p5/sketch_02/org/sketch_02.html
<!doctype html>
<html lang="ru">
<head>
<title>p5.js sketch 02</title>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title">p5.js sketch 02</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Введение</h2>
<div class="outline-text-2" id="text-1">
<p>
Продолжение цикла программирования на p5.js с помощью <a href="https://www.gnu.org/software/emacs/">emacs</a> с <a href="https://orgmode.org/">orgmode</a> в стиле <a href="http://www.literateprogramming.com/">literate programming</a>.
</p>

<p>
<a href="./sketch_02.org">Исходный код данной страницы</a> и <a href="../index.html">результат</a>. 
</p>

<p>
Экспорт исходного кода из данного файла сочетанием клавиш <code>C-c C-v C-t</code>.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Базовый HTML-документ</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-html"><span style="color: #CC9393;">&lt;!DOCTYPE html&gt;</span>
&lt;<span style="color: #93E0E3;">html</span> <span style="color: #DFAF8F;">lang</span>=<span style="color: #CC9393;">""</span>&gt;

&lt;<span style="color: #93E0E3;">head</span>&gt;
  &lt;<span style="color: #93E0E3;">meta</span> <span style="color: #DFAF8F;">charset</span>=<span style="color: #CC9393;">"utf-8"</span>&gt;
  &lt;<span style="color: #93E0E3;">meta</span> <span style="color: #DFAF8F;">name</span>=<span style="color: #CC9393;">"viewport"</span> <span style="color: #DFAF8F;">content</span>=<span style="color: #CC9393;">"width=device-width, initial-scale=1.0"</span>&gt;
  &lt;<span style="color: #93E0E3;">title</span>&gt;<span style="font-weight: bold; text-decoration: underline;">p5.js sketch 02</span>&lt;/<span style="color: #93E0E3;">title</span>&gt;
</pre>
</div>

<p>
Добавим ссылку на таблицу стилей.
</p>

<div class="org-src-container">

<pre class="src src-html">&lt;<span style="color: #93E0E3;">link</span> <span style="color: #DFAF8F;">rel</span>=<span style="color: #CC9393;">"stylesheet"</span> <span style="color: #DFAF8F;">href</span>=<span style="color: #CC9393;">"./styles.css"</span>&gt;
</pre>
</div>

<p>
А также ссылки на библиотеку p5.js и на исходный код нашей программы.
</p>

<div class="org-src-container">

<pre class="src src-html">&lt;<span style="color: #93E0E3;">script</span> <span style="color: #DFAF8F;">src</span>=<span style="color: #CC9393;">"../p5.js"</span>&gt;&lt;/<span style="color: #93E0E3;">script</span>&gt;
&lt;<span style="color: #93E0E3;">script</span> <span style="color: #DFAF8F;">src</span>=<span style="color: #CC9393;">"./sketch.js"</span>&gt;&lt;/<span style="color: #93E0E3;">script</span>&gt;
</pre>
</div>

<p>
И завершение базового файла.
</p>

<div class="org-src-container">

<pre class="src src-html">&lt;/<span style="color: #93E0E3;">head</span>&gt;

&lt;<span style="color: #93E0E3;">body</span>&gt;
&lt;/<span style="color: #93E0E3;">body</span>&gt;

&lt;/<span style="color: #93E0E3;">html</span>&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Таблица стилей</h2>
<div class="outline-text-2" id="text-3">
<p>
Таблица стилей будет вынесена в отдельный файл для большей практичности.
</p>

<p>
Сейчас основная задача — убрать поля и полосы прокрутки, которые возникнут и будт мешать восприятию, если ничего не предпринять.
</p>

<div class="org-src-container">

<pre class="src src-css"><span style="color: #93E0E3;">html </span>{
    <span style="color: #F0DFAF; font-weight: bold;">overflow</span>: hidden;
    <span style="color: #F0DFAF; font-weight: bold;">overflow-x</span>: hidden;
}
<span style="color: #93E0E3;">body </span>{
    <span style="color: #F0DFAF; font-weight: bold;">padding</span>: 0;
    <span style="color: #F0DFAF; font-weight: bold;">margin</span>: 0;
}
<span style="color: #93E0E3;">canvas </span>{
    <span style="color: #F0DFAF; font-weight: bold;">display</span>: block;
}
<span style="color: #93E0E3;">video </span>{
    <span style="color: #F0DFAF; font-weight: bold;">display</span>: block;
}

</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Скетч</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1">Настройка области рисования</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Настраиваем область рисования.
</p>

<div class="org-src-container">

<pre class="src src-javascript"><span style="color: #F0DFAF; font-weight: bold;">function</span> <span style="color: #93E0E3;">setup</span>() {
    <span style="color: #5F7F5F;">//</span><span style="color: #7F9F7F;">&#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1086;&#1077; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1074; &#1089; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1077; &#1086;&#1082;&#1085;&#1086;</span>
    createCanvas(windowWidth, windowHeight);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2">RGB и CMYK</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Нарисуем 8 образцов по моделям RGB и CMYK.
</p>

<div class="org-src-container">

<pre class="src src-javascript"><span style="color: #F0DFAF; font-weight: bold;">function</span> <span style="color: #93E0E3;">draw</span>() {
    background(255); <span style="color: #5F7F5F;">//</span><span style="color: #7F9F7F;">&#1086;&#1095;&#1080;&#1089;&#1090;&#1082;&#1072; &#1086;&#1082;&#1085;&#1072;</span>
    noStroke(); <span style="color: #5F7F5F;">//</span><span style="color: #7F9F7F;">&#1086;&#1090;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1084; &#1086;&#1090;&#1088;&#1080;&#1089;&#1086;&#1074;&#1082;&#1091; &#1086;&#1073;&#1074;&#1086;&#1076;&#1086;&#1082;</span>
    colorMode(RGB, 255); <span style="color: #5F7F5F;">//</span><span style="color: #7F9F7F;">&#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1084; &#1088;&#1077;&#1078;&#1080;&#1084; RGB</span>
    <span style="color: #F0DFAF; font-weight: bold;">let</span> <span style="color: #DFAF8F;">sampleWidth</span> = width / 5;
    <span style="color: #F0DFAF; font-weight: bold;">let</span> <span style="color: #DFAF8F;">sampleHeight</span> = height / 8;
    <span style="color: #F0DFAF; font-weight: bold;">let</span> <span style="color: #DFAF8F;">step</span> = 0;
    fill(255, 0, 0); <span style="color: #5F7F5F;">//</span><span style="color: #7F9F7F;">&#1082;&#1088;&#1072;&#1089;&#1085;&#1099;&#1081; (red)</span>
    rect(0, sampleHeight * (step++), sampleWidth, sampleHeight);
    fill(0, 255, 0); <span style="color: #5F7F5F;">//</span><span style="color: #7F9F7F;">&#1079;&#1077;&#1083;&#1077;&#1085;&#1099;&#1081; (green)</span>
    rect(0, sampleHeight * (step++), sampleWidth, sampleHeight);
    fill(0, 0, 255); <span style="color: #5F7F5F;">//</span><span style="color: #7F9F7F;">&#1089;&#1080;&#1085;&#1080;&#1081; (blue)</span>
    rect(0, sampleHeight * (step++), sampleWidth, sampleHeight);
    fill(0, 255, 255); <span style="color: #5F7F5F;">//</span><span style="color: #7F9F7F;">&#1075;&#1086;&#1083;&#1091;&#1073;&#1086;&#1081; (cyan)</span>
    rect(0, sampleHeight * (step++), sampleWidth, sampleHeight);
    fill(255, 0, 255); <span style="color: #5F7F5F;">//</span><span style="color: #7F9F7F;">&#1087;&#1091;&#1088;&#1087;&#1091;&#1088;&#1085;&#1099;&#1081; (magenta)</span>
    rect(0, sampleHeight * (step++), sampleWidth, sampleHeight);
    fill(255, 255, 0); <span style="color: #5F7F5F;">//</span><span style="color: #7F9F7F;">&#1078;&#1077;&#1083;&#1090;&#1099;&#1081; (yellow)</span>
    rect(0, sampleHeight * (step++), sampleWidth, sampleHeight);
    fill(255, 255, 255); <span style="color: #5F7F5F;">//</span><span style="color: #7F9F7F;">&#1073;&#1077;&#1083;&#1099;&#1081; (white)</span>
    rect(0, sampleHeight * (step++), sampleWidth, sampleHeight);
    fill(0, 0, 0); <span style="color: #5F7F5F;">//</span><span style="color: #7F9F7F;">&#1095;&#1077;&#1088;&#1085;&#1099;&#1081; (black)</span>
    rect(0, sampleHeight * (step++), sampleWidth, sampleHeight);
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3">RGB и HSB</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">

<pre class="src src-javascript">    sampleWidth *= 2;
    sampleHeight = height;
    <span style="color: #F0DFAF; font-weight: bold;">let</span> <span style="color: #DFAF8F;">red</span>, <span style="color: #DFAF8F;">green</span>, <span style="color: #DFAF8F;">blue</span>;
    <span style="color: #F0DFAF; font-weight: bold;">let</span> <span style="color: #DFAF8F;">hue</span>, <span style="color: #DFAF8F;">saturation</span>, <span style="color: #DFAF8F;">brightness</span>;
    <span style="color: #5F7F5F;">//</span><span style="color: #7F9F7F;">blue = hue = map(mouseX, 0, width, 0, 100);</span>
    blue = hue = 100;
    <span style="color: #F0DFAF; font-weight: bold;">for</span>(<span style="color: #F0DFAF; font-weight: bold;">let</span> <span style="color: #DFAF8F;">i</span> = 0; i &lt; sampleWidth; i++) {
        red = saturation = map(i, 0, sampleWidth, 0, 100);
        green = map(i, 0, sampleWidth, 0, 100);            
        blue = 100 - red;
        <span style="color: #F0DFAF; font-weight: bold;">for</span>(<span style="color: #F0DFAF; font-weight: bold;">let</span> <span style="color: #DFAF8F;">j</span> = 0; j &lt; sampleHeight; j++) {
            brightness = map(j, 0, sampleHeight, 0, 100);
            colorMode(RGB, 100.0);
            stroke(color(red-brightness, brightness-green, blue-brightness));
            point(width / 5 + i, j);
            colorMode(HSB, 100.0);
            stroke(color(hue, saturation, brightness));
            point(width / 5 * 3 + i, j);
        }
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4">Обработка изменения размера окна</h3>
<div class="outline-text-3" id="text-4-4">
<div class="org-src-container">

<pre class="src src-javascript"><span style="color: #F0DFAF; font-weight: bold;">function</span> <span style="color: #93E0E3;">windowResized</span>() {
    <span style="color: #5F7F5F;">//</span><span style="color: #7F9F7F;">&#1074; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1086;&#1082;&#1085;&#1072; &#1085;&#1072;&#1076;&#1086; &#1087;&#1077;&#1088;&#1077;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; &#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;</span>
    resizeCanvas(windowWidth, windowHeight);
}
</pre>
</div>
</div>
</div>
</div>
</div><div class="col-md-3"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">Введение</a></li>
<li><a href="#sec-2">Базовый HTML-документ</a></li>
<li><a href="#sec-3">Таблица стилей</a></li>
<li><a href="#sec-4">Скетч</a>
<ul class="nav">
<li><a href="#sec-4-1">Настройка области рисования</a></li>
<li><a href="#sec-4-2">RGB и CMYK</a></li>
<li><a href="#sec-4-3">RGB и HSB</a></li>
<li><a href="#sec-4-4">Обработка изменения размера окна</a></li>
</ul>
</li>
</ul>
</div>
</nav>
</div></div></div>
<footer id="postamble" class="">
<div></div>
</footer>
</body>
</html>
